/**
 * Есть множество (массив, где порядок не важен) целых чисел в диапазоне от 1 до 300. Количество чисел - от 5 до 1000. Простейший алгоритм сериализует множество в строку вида "1,300,237,188". Напишите функцию сериализации / десериализации в строку, чтобы итоговая строка была компактной (итоговая строка должна быть в 2 раза короче простейшей сериализации для любых возможных наборов чисел).
 * Цель задачи - максимально сжать данные относительно простой сериализации без алгоритма сжатия.
 * Сериализованная строка должна содержать только ASCII символы. Можно использовать любой язык программирования.
 * Вместе с решением нужно прислать набор тестов  - исходная строка, сжатая строка, коэффициент сжатия.
 * Примеры тестов: простейшие короткие, случайные - 50 чисел, 100 чисел, 500 чисел, 1000 чисел, граничные - все числа 1 знака, все числа из 2-х знаков, все числа из 3-х знаков, каждого числа по 3 - всего чисел 900.
 */

export function integerSerialize(nums: number[]): string{
    let serialized:string = ""
    return serialized
}

export function integerUnserialize(serialized: string): number[]{
    let nums:number[] = []
    return nums
}